Trunk/app/controllers/items_controller.rb

  def create
    #get list id param
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("name", "description", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "test"], ["description", "desc"], ["quantity", 1], ["created_at", "2016-03-28 22:25:19.858979"], ["updated_at", "2016-03-28 22:25:19.858979"]]

  def update
    respond_to do |format|
      if @item.update(item_params)
---
UPDATE "items" SET "description" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["description", "This is a description"], ["updated_at", "2016-03-29 16:42:23.681696"], ["id", 1]]