Trunk/app/controllers/lists_controller.rb

  def show
    #show list of items for related list
    choosenListID = 1
    @items = Item.where(list_id: choosenListID)
---
SELECT "items".* FROM "items" WHERE "items"."list_id" = ?  [["list_id", 1]]

  def create
    @list = List.new(list_params)

    respond_to do |format|
      if @list.save
---
INSERT INTO "lists" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "A name"], ["description", "This is a sexy list"], ["created_at", "2016-03-28 21:48:14.700904"], ["updated_at", "2016-03-28 21:48:14.700904"]]